Revit 2027 API
FabricationPart.HasDoubleWall Property
 True if the fabrication part is double walled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasDoubleWall { get; }
Public ReadOnly Property HasDoubleWall As Boolean
	Get
public:
property bool HasDoubleWall {
	bool get ();
}
member HasDoubleWall : bool with get
Property Value
Boolean
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace